let questions = [
    "1.你做事是一個值得信賴的人嗎？",
    "2. 你個性溫和嗎？",
    "3. 你有活力嗎？",
    "4. 你善解人意嗎？",
    "5. 你獨立嗎？",
    "6. 你受人愛戴嗎？",
    "7. 做事認真且正直嗎？",
    "8. 你富有同情心嗎？",
    "9. 你有說服力嗎？",
    "10. 你大膽嗎？",
    "11. 你精確嗎？",
    "12. 你適應能力強嗎？",
    "13. 你組織能力好嗎？",
    "14. 你是否積極主動？",
    "15. 你害羞嗎？",
    "16. 你強勢嗎？",
    "17. 你鎮定嗎？",
    "18. 你勇於學習嗎？",
    "19. 你反應快嗎？",
    "20. 你外向嗎？",
    "21. 你注意細節嗎？",
    "22. 你愛說話嗎？",
    "23. 你的協調能力好嗎？",
    "24. 你勤勞嗎？",
    "25. 你慷慨嗎？",
    "26. 你小心翼翼嗎？",
    "27. 你令人愉快嗎？",
    "28. 你傳統嗎？",
    "29. 你親切嗎？",
    "30. 你工作足夠有效率嗎？"
];

var point=[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0];
let finalAnswers=[
        "老虎型 (支配型Dominance) \n 有自信，夠權威，決斷力高，競爭性強，胸懷大志，喜歡評估。",
        "孔雀型 (表達型Extroversion) \n 很熱心，夠樂觀，口才流暢，好交朋友，風度翩翩，誠懇熱心。",
        "無尾熊型 (耐心型Patience) \n 很穩定，夠敦厚，溫和規律，不好衝突。",
        "貓頭鷹型 (精確型Conformity) \n 很傳統，注重細節，條理分明，責任感強，重視紀律。",
        "變色龍型 (整合型1/2 Sigma) \n 善於在工作中調整自己的角色去適應環境，具有很好的溝通能力。"
];